<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
	<meta http-equiv="content-type" content="text/html; charset=windows-1252"/>
	<title></title>
	<meta name="generator" content="LibreOffice 7.2.7.2 (Windows)"/>
	<meta name="created" content="2024-11-14T15:33:01.317000000"/>
	<meta name="changed" content="2024-11-14T15:33:35.268000000"/>
	<style type="text/css">
		@page { size: 21cm 29.7cm; margin: 2cm }
		p { line-height: 115%; margin-bottom: 0.25cm; background: transparent }
		h3 { margin-top: 0.25cm; margin-bottom: 0.21cm; background: transparent; page-break-after: avoid }
		h3.western { font-family: "Liberation Serif", serif; font-size: 14pt; font-weight: bold }
		h3.cjk { font-family: "NSimSun"; font-size: 14pt; font-weight: bold }
		h3.ctl { font-family: "Arial"; font-size: 14pt; font-weight: bold }
		h4 { margin-top: 0.21cm; margin-bottom: 0.21cm; background: transparent; page-break-after: avoid }
		h4.western { font-family: "Liberation Serif", serif; font-size: 12pt; font-weight: bold }
		h4.cjk { font-family: "NSimSun"; font-size: 12pt; font-weight: bold }
		h4.ctl { font-family: "Arial"; font-size: 12pt; font-weight: bold }
		h5 { margin-top: 0.21cm; margin-bottom: 0.11cm; background: transparent; page-break-after: avoid }
		h5.western { font-family: "Liberation Serif", serif; font-size: 10pt; font-weight: bold }
		h5.cjk { font-family: "NSimSun"; font-size: 10pt; font-weight: bold }
		h5.ctl { font-family: "Arial"; font-size: 10pt; font-weight: bold }
		h6 { margin-top: 0.11cm; margin-bottom: 0.11cm; background: transparent; page-break-after: avoid }
		h6.western { font-family: "Liberation Serif", serif; font-size: 7pt; font-weight: bold }
		h6.cjk { font-family: "NSimSun"; font-size: 7pt; font-weight: bold }
		h6.ctl { font-family: "Arial"; font-size: 7pt; font-weight: bold }
		strong { font-weight: bold }
		a:link { color: #000080; so-language: zxx; text-decoration: underline }
		a:visited { color: #800000; so-language: zxx; text-decoration: underline }
	</style>
</head>
<body lang="pt-BR" link="#000080" vlink="#800000" dir="ltr"><h3 class="western">
<strong>Resumo sobre Business Intelligence (BI), Sistemas de Suporte
&agrave; Decis&atilde;o, Data Warehouse com ETL e OLAP</strong></h3>
<p>Business Intelligence (BI), Sistemas de Suporte &agrave; Decis&atilde;o
(DSS), Data Warehouse (DW), ETL (Extract, Transform, Load) e OLAP
(Online Analytical Processing) s&atilde;o conceitos e tecnologias
fundamentais para a an&aacute;lise de dados empresariais e apoio &agrave;
tomada de decis&otilde;es. Esses sistemas e t&eacute;cnicas permitem
que as empresas transformem grandes volumes de dados em informa&ccedil;&otilde;es
&uacute;teis para planejamento estrat&eacute;gico, opera&ccedil;&otilde;es
e performance.</p>
<p>Aqui est&aacute; um resumo sobre esses conceitos, suas
caracter&iacute;sticas, fundamentos, e exemplos pr&aacute;ticos.</p>
<hr/>

<h3 class="western"><strong>1. Business Intelligence (BI)</strong></h3>
<p><strong>Business Intelligence (BI)</strong> &eacute; um conjunto
de t&eacute;cnicas e ferramentas usadas para transformar dados brutos
em informa&ccedil;&otilde;es &uacute;teis para decis&otilde;es
empresariais. BI envolve a coleta, an&aacute;lise e visualiza&ccedil;&atilde;o
de dados hist&oacute;ricos, atuais e projetados, a fim de apoiar
decis&otilde;es mais informadas, aumentar a efici&ecirc;ncia e
melhorar o desempenho organizacional.</p>
<h4 class="western"><strong>Fundamentos e Caracter&iacute;sticas do
BI:</strong></h4>
<ul>
	<li><p style="margin-bottom: 0cm"><strong>Coleta de Dados</strong>:
	Processo de reunir dados de diversas fontes, como sistemas
	operacionais, bancos de dados, redes sociais, entre outros.</p>
	<li><p style="margin-bottom: 0cm"><strong>An&aacute;lise de Dados</strong>:
	Uso de ferramentas anal&iacute;ticas para examinar dados e
	identificar padr&otilde;es, tend&ecirc;ncias e insights.</p>
	<li><p style="margin-bottom: 0cm"><strong>Relat&oacute;rios e
	Dashboards</strong>: Ferramentas visuais que ajudam os tomadores de
	decis&atilde;o a entender melhor os dados.</p>
	<li><p><strong>Integra&ccedil;&atilde;o de Dados</strong>:
	Combina&ccedil;&atilde;o de dados de diferentes fontes em um formato
	unificado para an&aacute;lise.</p>
</ul>
<h4 class="western"><strong>T&eacute;cnicas e M&eacute;todos de BI:</strong></h4>
<ul>
	<li><p style="margin-bottom: 0cm"><strong>Data Mining</strong>:
	T&eacute;cnica usada para identificar padr&otilde;es e rela&ccedil;&otilde;es
	em grandes volumes de dados.</p>
	<li><p style="margin-bottom: 0cm"><strong>An&aacute;lise Descritiva</strong>:
	Examina dados hist&oacute;ricos para descrever o que aconteceu em um
	determinado per&iacute;odo.</p>
	<li><p style="margin-bottom: 0cm"><strong>An&aacute;lise Preditiva</strong>:
	Utiliza modelos estat&iacute;sticos para prever futuros resultados
	com base em dados hist&oacute;ricos.</p>
	<li><p><strong>An&aacute;lise Prescritiva</strong>: Proporciona
	recomenda&ccedil;&otilde;es para decis&otilde;es com base nas
	an&aacute;lises preditivas.</p>
</ul>
<h4 class="western"><strong>Exemplo Pr&aacute;tico de BI:</strong></h4>
<p>Uma <strong>empresa de e-commerce</strong> pode usar BI para
analisar as vendas, identificar os produtos mais vendidos, entender
os padr&otilde;es de compra dos clientes e ajustar estrat&eacute;gias
de marketing e estoque. Relat&oacute;rios e dashboards de BI fornecem
uma vis&atilde;o clara sobre as m&eacute;tricas de desempenho da
empresa, como lucros, perdas e vendas por regi&atilde;o.</p>
<hr/>

<h3 class="western"><strong>2. Sistemas de Suporte &agrave; Decis&atilde;o
(DSS)</strong></h3>
<p><strong>Sistemas de Suporte &agrave; Decis&atilde;o (DSS)</strong>
s&atilde;o sistemas interativos baseados em computador que ajudam os
tomadores de decis&atilde;o a resolver problemas complexos,
proporcionando suporte em situa&ccedil;&otilde;es de decis&atilde;o.
Eles n&atilde;o tomam decis&otilde;es, mas oferecem ferramentas e
informa&ccedil;&otilde;es para ajudar os usu&aacute;rios a fazer
escolhas mais informadas.</p>
<h4 class="western"><strong>Fundamentos e Caracter&iacute;sticas dos
DSS:</strong></h4>
<ul>
	<li><p style="margin-bottom: 0cm"><strong>Interatividade</strong>:
	Os usu&aacute;rios podem manipular os dados e cen&aacute;rios para
	explorar diferentes op&ccedil;&otilde;es.</p>
	<li><p style="margin-bottom: 0cm"><strong>An&aacute;lise
	Multidimensional</strong>: Permite analisar os dados de diferentes
	perspectivas (por exemplo, tempo, geografia, categorias de
	produtos).</p>
	<li><p style="margin-bottom: 0cm"><strong>Suporte a Decis&otilde;es
	N&atilde;o Estruturadas</strong>: Ajuda em situa&ccedil;&otilde;es
	em que n&atilde;o h&aacute; uma &uacute;nica solu&ccedil;&atilde;o
	clara ou estruturada.</p>
	<li><p><strong>Flexibilidade</strong>: Permite personalizar as
	an&aacute;lises conforme as necessidades do usu&aacute;rio.</p>
</ul>
<h4 class="western"><strong>Exemplo Pr&aacute;tico de DSS:</strong></h4>
<p>Um <strong>DSS em uma empresa de log&iacute;stica</strong> pode
ajudar a decidir as melhores rotas para a entrega de produtos,
considerando vari&aacute;veis como custo, tempo e dist&acirc;ncia. O
sistema fornece diferentes cen&aacute;rios baseados em par&acirc;metros
e permite ao gestor selecionar a melhor estrat&eacute;gia.</p>
<hr/>

<h3 class="western"><strong>3. Arquitetura e Aplica&ccedil;&otilde;es
de Data Warehouse com ETL e OLAP</strong></h3>
<h4 class="western"><strong>Data Warehouse (DW)</strong></h4>
<p><strong>Data Warehouse</strong> &eacute; um reposit&oacute;rio
centralizado de dados integrados de diversas fontes. Ele armazena
grandes volumes de dados hist&oacute;ricos que s&atilde;o usados para
an&aacute;lise de neg&oacute;cios. O DW &eacute; projetado para
otimizar a consulta e an&aacute;lise de dados, em vez de transa&ccedil;&otilde;es
di&aacute;rias.</p>
<h5 class="western"><strong>Caracter&iacute;sticas de um Data
Warehouse:</strong></h5>
<ul>
	<li><p style="margin-bottom: 0cm"><strong>Integrado</strong>: Re&uacute;ne
	dados de diferentes fontes e os organiza em um formato consistente.</p>
	<li><p style="margin-bottom: 0cm"><strong>Orientado ao assunto</strong>:
	Organiza dados em torno de t&oacute;picos importantes para a an&aacute;lise
	(ex.: vendas, finan&ccedil;as).</p>
	<li><p style="margin-bottom: 0cm"><strong>N&atilde;o vol&aacute;til</strong>:
	Dados n&atilde;o s&atilde;o alterados, apenas agregados ou
	atualizados periodicamente.</p>
	<li><p><strong>Hist&oacute;rico</strong>: Mant&eacute;m dados
	hist&oacute;ricos que podem ser usados para an&aacute;lises ao longo
	do tempo.</p>
</ul>
<h4 class="western"><strong>ETL (Extract, Transform, Load)</strong></h4>
<p>O <strong>ETL</strong> &eacute; o processo de extra&ccedil;&atilde;o
de dados de fontes diferentes, transforma&ccedil;&atilde;o desses
dados para um formato adequado e carregamento no Data Warehouse para
an&aacute;lise posterior.</p>
<h5 class="western"><strong>Etapas do ETL:</strong></h5>
<ol>
	<li><p style="margin-bottom: 0cm"><strong>Extra&ccedil;&atilde;o
	(Extract)</strong>: Coleta de dados de diferentes fontes, como
	bancos de dados transacionais, arquivos de texto, APIs, entre
	outros.</p>
	<li><p style="margin-bottom: 0cm"><strong>Transforma&ccedil;&atilde;o
	(Transform)</strong>: Os dados extra&iacute;dos s&atilde;o limpos,
	filtrados e transformados para garantir a consist&ecirc;ncia e
	qualidade. Isso pode incluir remo&ccedil;&atilde;o de duplicatas,
	convers&atilde;o de tipos de dados, entre outras opera&ccedil;&otilde;es.</p>
	<li><p><strong>Carregamento (Load)</strong>: Os dados transformados
	s&atilde;o carregados no Data Warehouse, prontos para an&aacute;lise.</p>
</ol>
<h4 class="western"><strong>OLAP (Online Analytical Processing)</strong></h4>
<p><strong>OLAP</strong> refere-se a um conjunto de tecnologias que
permitem aos usu&aacute;rios realizar an&aacute;lises r&aacute;pidas
de dados multidimensionais. OLAP permite a explora&ccedil;&atilde;o
de grandes volumes de dados e a an&aacute;lise sob diferentes
perspectivas, por meio de uma estrutura chamada &quot;cubo OLAP&quot;.</p>
<h5 class="western"><strong>Caracter&iacute;sticas de OLAP:</strong></h5>
<ul>
	<li><p style="margin-bottom: 0cm"><strong>Multidimensionalidade</strong>:
	Permite a visualiza&ccedil;&atilde;o dos dados sob m&uacute;ltiplas
	perspectivas (por exemplo, vendas por produto, por regi&atilde;o,
	por per&iacute;odo).</p>
	<li><p style="margin-bottom: 0cm"><strong>Consulta interativa</strong>:
	Usu&aacute;rios podem interagir com os dados, &quot;fatiando&quot; e
	&quot;cortando&quot; os cubos para visualizar diferentes detalhes.</p>
	<li><p><strong>Alta Performance</strong>: Otimiza consultas r&aacute;pidas,
	mesmo em grandes volumes de dados.</p>
</ul>
<h4 class="western"><strong>Exemplo Pr&aacute;tico de Data Warehouse,
ETL e OLAP:</strong></h4>
<p>Imagine uma <strong>empresa de varejo</strong> que deseja analisar
o desempenho de vendas em diferentes lojas e regi&otilde;es ao longo
do ano. Eles coletam dados de transa&ccedil;&otilde;es de v&aacute;rios
sistemas de ponto de venda (POS), aplicam um processo <strong>ETL</strong>
para limpar e transformar os dados e, em seguida, armazenam essas
informa&ccedil;&otilde;es em um <strong>Data Warehouse</strong>. Com
o uso de <strong>OLAP</strong>, eles podem gerar relat&oacute;rios
din&acirc;micos que permitem analisar as vendas de produtos por loja,
por categoria de produto e por trimestre, ajudando a identificar
padr&otilde;es de compra e a tomar decis&otilde;es estrat&eacute;gicas
sobre estoque e marketing.</p>
<hr/>

<h3 class="western"><strong>Exemplo Pr&aacute;tico Integrado</strong></h3>
<p>Uma <strong>institui&ccedil;&atilde;o financeira</strong> pode
usar uma arquitetura de <strong>Data Warehouse</strong> para
armazenar dados de transa&ccedil;&otilde;es banc&aacute;rias,
extratos de clientes, informa&ccedil;&otilde;es de mercado e outros
dados financeiros. O processo <strong>ETL</strong> seria respons&aacute;vel
por extrair dados de sistemas banc&aacute;rios, transform&aacute;-los
para um formato padronizado (como moeda &uacute;nica, convers&atilde;o
de fusos hor&aacute;rios) e carreg&aacute;-los no <strong>Data
Warehouse</strong>. A partir disso, analistas podem usar ferramentas
<strong>OLAP</strong> para analisar os dados de forma
multidimensional &mdash; por exemplo, verificando o saldo de clientes
por categoria (contas correntes, poupan&ccedil;a, investimentos), por
per&iacute;odo (mensal, anual) e por geolocaliza&ccedil;&atilde;o
(regi&otilde;es com maior ou menor movimenta&ccedil;&atilde;o de
conta corrente). Essa an&aacute;lise ajuda os gestores a tomar
decis&otilde;es em tempo real, como oferecer servi&ccedil;os
financeiros diferenciados ou reajustar taxas de juros.</p>
<hr/>

<h3 class="western"><strong>Conclus&atilde;o</strong></h3>
<p><strong>Business Intelligence (BI)</strong>, <strong>Sistemas de
Suporte &agrave; Decis&atilde;o (DSS)</strong>, <strong>Data
Warehouse</strong>, <strong>ETL</strong> e <strong>OLAP</strong> s&atilde;o
componentes cruciais para a an&aacute;lise e tomada de decis&atilde;o
estrat&eacute;gica em empresas. Ao integrar esses sistemas e
t&eacute;cnicas, as organiza&ccedil;&otilde;es conseguem obter
insights valiosos de dados hist&oacute;ricos e atuais, otimizar
processos e melhorar o desempenho geral. O uso eficiente dessas
ferramentas proporciona uma vantagem competitiva significativa,
permitindo decis&otilde;es mais r&aacute;pidas e precisas.</p>
<p>4o mini</p>
<h5 class="western">Voc&ecirc; disse:</h5>
<p>Conceitos, fundamentos, caracter&iacute;sticas, t&eacute;cnicas e
m&eacute;todos de business intelligence (BI). 2 Sistemas de suporte a
decis&atilde;o e gest&atilde;o de conte&uacute;do. 3 Arquitetura e
aplica&ccedil;&otilde;es de data warehouse com ETL e OLAP &lt; 20
quest&otilde;es m&uacute;ltipla escolha, banca FGV , respostas
explicadas 
</p>
<h6 class="western">O ChatGPT disse:</h6>
<p>ChatGPT</p>
<p>Aqui est&atilde;o <strong>20 quest&otilde;es de m&uacute;ltipla
escolha</strong> sobre <strong>Business Intelligence (BI)</strong>,
<strong>Sistemas de Suporte &agrave; Decis&atilde;o (DSS)</strong>,
<strong>Gest&atilde;o de Conte&uacute;do</strong>, <strong>Data
Warehouse (DW)</strong>, <strong>ETL</strong>, e <strong>OLAP</strong>,
com as respectivas <strong>respostas explicadas</strong>, no estilo
da <strong>banca FGV</strong>.</p>
<hr/>

<h3 class="western"><strong>1. O que &eacute; o Business Intelligence
(BI)?</strong></h3>
<p>A) Um conjunto de ferramentas que permitem a an&aacute;lise de
grandes volumes de dados em tempo real.<br/>
B) Um conjunto de
tecnologias e processos para transformar dados em informa&ccedil;&otilde;es
&uacute;teis para a tomada de decis&otilde;es empresariais.<br/>
C)
Um processo exclusivo para an&aacute;lise financeira e cont&aacute;bil
dentro de uma empresa.<br/>
D) Um sistema usado apenas para a
visualiza&ccedil;&atilde;o de dados em gr&aacute;ficos interativos.</p>
<p><strong>Resposta correta:</strong> B) <strong>Um conjunto de
tecnologias e processos para transformar dados em informa&ccedil;&otilde;es
&uacute;teis para a tomada de decis&otilde;es empresariais.</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong><br/>
O <strong>Business
Intelligence (BI)</strong> envolve t&eacute;cnicas e ferramentas que
ajudam as empresas a transformar dados brutos em informa&ccedil;&otilde;es
valiosas para a tomada de decis&otilde;es. Ele usa dados hist&oacute;ricos,
atuais e projetados para melhorar o desempenho organizacional.</p>
<hr/>

<h3 class="western"><strong>2. Qual &eacute; o objetivo principal de
um Sistema de Suporte &agrave; Decis&atilde;o (DSS)?</strong></h3>
<p>A) Automatizar o processo de decis&atilde;o em ambientes de alta
complexidade.<br/>
B) Auxiliar os gestores a tomar decis&otilde;es
com base em dados, an&aacute;lises e modelos preditivos.<br/>
C)
Substituir a necessidade de tomada de decis&atilde;o humana em todos
os n&iacute;veis organizacionais.<br/>
D) Gerenciar dados
operacionais di&aacute;rios e garantir que as decis&otilde;es sejam
tomadas sem erros.</p>
<p><strong>Resposta correta:</strong> B) <strong>Auxiliar os gestores
a tomar decis&otilde;es com base em dados, an&aacute;lises e modelos
preditivos.</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong><br/>
O <strong>DSS</strong>
ajuda os gestores a tomar decis&otilde;es em situa&ccedil;&otilde;es
de incerteza, fornecendo informa&ccedil;&otilde;es detalhadas e
an&aacute;lises baseadas em dados e modelos matem&aacute;ticos, mas a
decis&atilde;o final &eacute; sempre tomada pelos gestores.</p>
<hr/>

<h3 class="western"><strong>3. Qual das alternativas a seguir &eacute;
uma caracter&iacute;stica t&iacute;pica de sistemas BI?</strong></h3>
<p>A) Armazenamento de dados operacionais em tempo real.<br/>
B)
Envio autom&aacute;tico de relat&oacute;rios por e-mail.<br/>
C)
Transforma&ccedil;&atilde;o e an&aacute;lise de grandes volumes de
dados hist&oacute;ricos para tomada de decis&atilde;o.<br/>
D)
Realiza&ccedil;&atilde;o de transa&ccedil;&otilde;es de banco de
dados em tempo real.</p>
<p><strong>Resposta correta:</strong> C) <strong>Transforma&ccedil;&atilde;o
e an&aacute;lise de grandes volumes de dados hist&oacute;ricos para
tomada de decis&atilde;o.</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong><br/>
<strong>Business
Intelligence</strong> envolve principalmente a an&aacute;lise de
dados hist&oacute;ricos e transacionais para apoiar a tomada de
decis&otilde;es estrat&eacute;gicas. O foco n&atilde;o est&aacute; em
transa&ccedil;&otilde;es em tempo real, mas na an&aacute;lise e
visualiza&ccedil;&atilde;o dos dados para identificar padr&otilde;es
e tend&ecirc;ncias.</p>
<hr/>

<h3 class="western"><strong>4. Qual &eacute; a principal fun&ccedil;&atilde;o
do ETL em um Data Warehouse?</strong></h3>
<p>A) Extrair dados de fontes externas, transform&aacute;-los para um
formato adequado e carreg&aacute;-los no banco de dados.<br/>
B)
Executar consultas SQL complexas em dados hist&oacute;ricos.<br/>
C)
Visualizar os dados de maneira interativa.<br/>
D) Carregar dados
diretamente de sistemas de gest&atilde;o de relacionamento com
clientes (CRM).</p>
<p><strong>Resposta correta:</strong> A) <strong>Extrair dados de
fontes externas, transform&aacute;-los para um formato adequado e
carreg&aacute;-los no banco de dados.</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong><br/>
<strong>ETL
(Extract, Transform, Load)</strong> &eacute; o processo utilizado
para extrair dados de diferentes fontes, transform&aacute;-los em um
formato adequado e carreg&aacute;-los no <strong>Data Warehouse</strong>
para posterior an&aacute;lise.</p>
<hr/>

<h3 class="western"><strong>5. O que significa OLAP no contexto de
Business Intelligence?</strong></h3>
<p>A) Um sistema de gest&atilde;o de dados operacionais em tempo
real.<br/>
B) Uma t&eacute;cnica de minera&ccedil;&atilde;o de dados
para prever o comportamento futuro.<br/>
C) Uma ferramenta de an&aacute;lise
multidimensional que permite explorar grandes volumes de dados.<br/>
D)
Uma aplica&ccedil;&atilde;o de visualiza&ccedil;&atilde;o de dados
que n&atilde;o envolve consultas interativas.</p>
<p><strong>Resposta correta:</strong> C) <strong>Uma ferramenta de
an&aacute;lise multidimensional que permite explorar grandes volumes
de dados.</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong><br/>
<strong>OLAP
(Online Analytical Processing)</strong> &eacute; uma tecnologia que
permite a an&aacute;lise multidimensional de dados, proporcionando
uma maneira interativa e r&aacute;pida de consultar grandes volumes
de dados e explorar diferentes perspectivas, como vendas por produto,
regi&atilde;o e per&iacute;odo.</p>
<hr/>

<h3 class="western"><strong>6. Qual &eacute; o prop&oacute;sito de um
Data Warehouse em um processo de BI?</strong></h3>
<p>A) Armazenar dados em tempo real para suportar transa&ccedil;&otilde;es
financeiras.<br/>
B) Consolidar dados hist&oacute;ricos e
operacionais de v&aacute;rias fontes para an&aacute;lise e tomada de
decis&atilde;o.<br/>
C) Gerenciar dados de marketing e promover a&ccedil;&otilde;es
de vendas.<br/>
D) Controlar o fluxo de dados entre os diferentes
sistemas de uma empresa.</p>
<p><strong>Resposta correta:</strong> B) <strong>Consolidar dados
hist&oacute;ricos e operacionais de v&aacute;rias fontes para an&aacute;lise
e tomada de decis&atilde;o.</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong><br/>
Um <strong>Data
Warehouse</strong> &eacute; um reposit&oacute;rio central de dados
integrados e hist&oacute;ricos provenientes de diversas fontes. Ele &eacute;
projetado para an&aacute;lise e gera&ccedil;&atilde;o de relat&oacute;rios
e n&atilde;o para processar transa&ccedil;&otilde;es em tempo real.</p>
<hr/>

<h3 class="western"><strong>7. Qual a principal vantagem do uso de
OLAP para an&aacute;lise de dados?</strong></h3>
<p>A) Permite uma an&aacute;lise em tempo real de grandes volumes de
dados.<br/>
B) Oferece uma maneira interativa de analisar os dados de
diferentes perspectivas e de realizar an&aacute;lises r&aacute;pidas.<br/>
C)
Facilita a realiza&ccedil;&atilde;o de transa&ccedil;&otilde;es
financeiras de alta complexidade.<br/>
D) &Eacute; mais barato do que
sistemas tradicionais de BI.</p>
<p><strong>Resposta correta:</strong> B) <strong>Oferece uma maneira
interativa de analisar os dados de diferentes perspectivas e de
realizar an&aacute;lises r&aacute;pidas.</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong><br/>
<strong>OLAP</strong>
oferece uma interface interativa que permite ao usu&aacute;rio
explorar dados multidimensionais, o que facilita a visualiza&ccedil;&atilde;o
e an&aacute;lise de grandes volumes de dados, proporcionando uma
maneira eficiente de tomar decis&otilde;es r&aacute;pidas.</p>
<hr/>

<h3 class="western"><strong>8. O que caracteriza um Sistemas de
Suporte &agrave; Decis&atilde;o (DSS) em compara&ccedil;&atilde;o com
um sistema de BI?</strong></h3>
<p>A) O DSS se concentra na an&aacute;lise de dados hist&oacute;ricos,
enquanto o BI foca em dados em tempo real.<br/>
B) O DSS fornece
recomenda&ccedil;&otilde;es autom&aacute;ticas, enquanto o BI apenas
coleta dados.<br/>
C) O DSS auxilia na an&aacute;lise de dados
espec&iacute;ficos para tomada de decis&atilde;o, enquanto o BI
oferece uma vis&atilde;o mais abrangente.<br/>
D) O DSS e o BI t&ecirc;m
os mesmos objetivos e funcionalidades.</p>
<p><strong>Resposta correta:</strong> C) <strong>O DSS auxilia na
an&aacute;lise de dados espec&iacute;ficos para tomada de decis&atilde;o,
enquanto o BI oferece uma vis&atilde;o mais abrangente.</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong><br/>
Embora ambos os
sistemas ajudem na tomada de decis&otilde;es, o <strong>DSS</strong>
&eacute; mais focado em fornecer suporte espec&iacute;fico para
decis&otilde;es complexas, enquanto o <strong>BI</strong> oferece uma
vis&atilde;o geral e an&aacute;lises de grandes volumes de dados para
decis&otilde;es mais amplas.</p>
<hr/>

<h3 class="western"><strong>9. O que &eacute; a transforma&ccedil;&atilde;o
de dados no processo ETL?</strong></h3>
<p>A) A organiza&ccedil;&atilde;o de dados em tabelas de um banco de
dados relacional.<br/>
B) A convers&atilde;o dos dados para um
formato adequado e a limpeza para garantir sua consist&ecirc;ncia.<br/>
C)
A coleta de dados a partir de fontes externas.<br/>
D) A cria&ccedil;&atilde;o
de backups dos dados antes de carreg&aacute;-los no banco de dados.</p>
<p><strong>Resposta correta:</strong> B) <strong>A convers&atilde;o
dos dados para um formato adequado e a limpeza para garantir sua
consist&ecirc;ncia.</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong><br/>
A <strong>transforma&ccedil;&atilde;o</strong>
&eacute; a etapa em que os dados s&atilde;o convertidos, limpos e
preparados para se adequar ao formato necess&aacute;rio para o
carregamento no <strong>Data Warehouse</strong>.</p>
<hr/>

<h3 class="western"><strong>10. Em qual situa&ccedil;&atilde;o o uso
de BI &eacute; mais vantajoso?</strong></h3>
<p>A) Quando se deseja automatizar o processo de produ&ccedil;&atilde;o
de um produto em larga escala.<br/>
B) Quando se necessita de uma
vis&atilde;o clara das opera&ccedil;&otilde;es e do desempenho para
tomar decis&otilde;es estrat&eacute;gicas informadas.<br/>
C) Quando
se quer otimizar a efici&ecirc;ncia dos processos de fabrica&ccedil;&atilde;o
de uma empresa.<br/>
D) Quando se precisa de uma solu&ccedil;&atilde;o
para suportar transa&ccedil;&otilde;es em tempo real.</p>
<p><strong>Resposta correta:</strong> B) <strong>Quando se necessita
de uma vis&atilde;o clara das opera&ccedil;&otilde;es e do desempenho
para tomar decis&otilde;es estrat&eacute;gicas informadas.</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong><br/>
<strong>Business
Intelligence</strong> &eacute; mais &uacute;til para oferecer uma
vis&atilde;o hol&iacute;stica das opera&ccedil;&otilde;es de uma
empresa e apoiar decis&otilde;es estrat&eacute;gicas, como marketing,
estoque e finan&ccedil;as, com base em dados anal&iacute;ticos e
hist&oacute;ricos.</p>
<hr/>

<h3 class="western"><strong>11. Quais dados um Data Warehouse
normalmente armazena?</strong></h3>
<p>A) Dados transacionais em tempo real, como vendas e compras.<br/>
B)
Dados hist&oacute;ricos e agregados de diversas fontes para an&aacute;lise
e gera&ccedil;&atilde;o de relat&oacute;rios.<br/>
C) Dados pessoais
de clientes e funcion&aacute;rios.<br/>
D) Dados de redes sociais,
como intera&ccedil;&otilde;es e mensagens.</p>
<p><strong>Resposta correta:</strong> B) <strong>Dados hist&oacute;ricos
e agregados de diversas fontes para an&aacute;lise e gera&ccedil;&atilde;o
de relat&oacute;rios.</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong><br/>
<strong>Data
Warehouses</strong> s&atilde;o reposit&oacute;rios de dados que
armazenam informa&ccedil;&otilde;es hist&oacute;ricas, agregadas e de
v&aacute;rias fontes para an&aacute;lise estrat&eacute;gica e gera&ccedil;&atilde;o
de relat&oacute;rios.</p>
<hr/>

<h3 class="western"><strong>12. Qual dos seguintes tipos de an&aacute;lise
o OLAP permite fazer?</strong></h3>
<p>A) An&aacute;lise de dados transacionais em tempo real.<br/>
B)
An&aacute;lise multidimensional, permitindo visualizar dados sob
v&aacute;rias perspectivas.<br/>
C) An&aacute;lise preditiva de
vendas futuras.<br/>
D) An&aacute;lise de dados apenas para fins
cont&aacute;beis.</p>
<p><strong>Resposta correta:</strong> B) <strong>An&aacute;lise
multidimensional, permitindo visualizar dados sob v&aacute;rias
perspectivas.</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong><br/>
<strong>OLAP</strong>
permite a an&aacute;lise multidimensional, onde os dados podem ser
analisados sob</p>
<p style="line-height: 100%; margin-bottom: 0cm"><br/>

</p>
</body>
</html>