<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
	<meta http-equiv="content-type" content="text/html; charset=windows-1252"/>
	<title></title>
	<meta name="generator" content="LibreOffice 7.2.7.2 (Windows)"/>
	<meta name="created" content="2024-11-12T15:39:31.602000000"/>
	<meta name="changed" content="2024-11-12T15:42:04.039000000"/>
	<style type="text/css">
		@page { size: 21cm 29.7cm; margin: 2cm }
		p { line-height: 115%; margin-bottom: 0.25cm; background: transparent }
		h3 { margin-top: 0.25cm; margin-bottom: 0.21cm; background: transparent; page-break-after: avoid }
		h3.western { font-family: "Liberation Serif", serif; font-size: 14pt; font-weight: bold }
		h3.cjk { font-family: "NSimSun"; font-size: 14pt; font-weight: bold }
		h3.ctl { font-family: "Arial"; font-size: 14pt; font-weight: bold }
		strong { font-weight: bold }
	</style>
</head>
<body lang="pt-BR" link="#000080" vlink="#800000" dir="ltr"><p>5
quest&otilde;es de m&uacute;ltipla escolha, no estilo FGV, focadas em
User Experience (UX) e Sistemas de Gest&atilde;o de Conte&uacute;do,
com &ecirc;nfase nos subtemas que voc&ecirc; mencionou. Cada quest&atilde;o
ter&aacute; uma explica&ccedil;&atilde;o detalhada da resposta. Vamos
l&aacute;:</p>
<hr/>

<h3 class="western"><strong>Quest&otilde;es sobre User Experience
(UX)</strong></h3>
<p><strong>1. Qual das alternativas abaixo melhor descreve o conceito
de &quot;User Experience&quot; (UX)?</strong></p>
<p>a) A experi&ecirc;ncia de navega&ccedil;&atilde;o de um usu&aacute;rio
com o objetivo de encontrar conte&uacute;dos espec&iacute;ficos em um
site.<br/>
b) O processo de criar interfaces que permitam aos
usu&aacute;rios executar tarefas de forma r&aacute;pida e
eficiente.<br/>
c) A percep&ccedil;&atilde;o do usu&aacute;rio sobre
a usabilidade e o prazer ao interagir com um produto ou servi&ccedil;o.<br/>
d)
A an&aacute;lise do comportamento do usu&aacute;rio atrav&eacute;s de
m&eacute;tricas quantitativas, como tempo de navega&ccedil;&atilde;o
e taxa de cliques.</p>
<p><strong>Resposta correta: c)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> UX refere-se &agrave;
percep&ccedil;&atilde;o do usu&aacute;rio ao interagir com um produto
ou servi&ccedil;o, levando em considera&ccedil;&atilde;o aspectos
como usabilidade, prazer, efici&ecirc;ncia e satisfa&ccedil;&atilde;o.
A alternativa correta &eacute; a que menciona a percep&ccedil;&atilde;o
do usu&aacute;rio sobre esses aspectos.</p>
<hr/>

<p><strong>2. O que &eacute; &quot;Wireframe&quot; no contexto de
design de UX?</strong></p>
<p>a) Um tipo de prot&oacute;tipo de alta fidelidade com elementos
gr&aacute;ficos e interatividade.<br/>
b) Uma representa&ccedil;&atilde;o
visual do layout de uma p&aacute;gina, focando apenas na estrutura,
sem elementos de design visual.<br/>
c) A an&aacute;lise estat&iacute;stica
do comportamento do usu&aacute;rio para melhorar a usabilidade do
sistema.<br/>
d) O processo de codifica&ccedil;&atilde;o da interface
do usu&aacute;rio com base em prot&oacute;tipos criados
anteriormente.</p>
<p><strong>Resposta correta: b)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Wireframe &eacute; um
esbo&ccedil;o simples que ilustra a estrutura de uma p&aacute;gina,
sem detalhes visuais, como cores ou fontes. O objetivo &eacute;
mostrar como os elementos ser&atilde;o dispostos e como os usu&aacute;rios
navegar&atilde;o.</p>
<hr/>

<p><strong>3. Qual &eacute; a principal fun&ccedil;&atilde;o do
&quot;Testes de Usabilidade&quot; em projetos de UX?</strong></p>
<p>a) Garantir que o site ou aplica&ccedil;&atilde;o seja responsivo
em diferentes dispositivos.<br/>
b) Avaliar a experi&ecirc;ncia do
usu&aacute;rio ao interagir com o sistema para identificar melhorias
em termos de efici&ecirc;ncia e satisfa&ccedil;&atilde;o.<br/>
c)
Definir as melhores estrat&eacute;gias de marketing para promover o
produto ou servi&ccedil;o.<br/>
d) Testar a velocidade de
carregamento das p&aacute;ginas de um site.</p>
<p><strong>Resposta correta: b)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Testes de usabilidade
t&ecirc;m como objetivo observar e avaliar a experi&ecirc;ncia do
usu&aacute;rio ao interagir com um sistema. A partir dos resultados,
&eacute; poss&iacute;vel identificar problemas e otimizar a interface
para melhorar a satisfa&ccedil;&atilde;o e a efici&ecirc;ncia do
usu&aacute;rio.</p>
<hr/>

<p><strong>4. Qual &eacute; a abordagem mais comum para entender as
necessidades e expectativas dos usu&aacute;rios em um projeto de UX?</strong></p>
<p>a) Pesquisa com stakeholders internos da empresa.<br/>
b) An&aacute;lise
de dados quantitativos de navega&ccedil;&atilde;o, como m&eacute;tricas
de tempo e cliques.<br/>
c) Entrevistas e observa&ccedil;&atilde;o
direta de usu&aacute;rios em situa&ccedil;&otilde;es reais de uso.<br/>
d)
Desenvolvimento de prot&oacute;tipos baseados em suposi&ccedil;&otilde;es
da equipe de design.</p>
<p><strong>Resposta correta: c)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> A observa&ccedil;&atilde;o
direta de usu&aacute;rios em situa&ccedil;&otilde;es reais, atrav&eacute;s
de entrevistas ou sess&otilde;es de testes, &eacute; uma das formas
mais eficazes de entender suas necessidades e expectativas. Isso
ajuda a projetar solu&ccedil;&otilde;es mais centradas no usu&aacute;rio.</p>
<hr/>

<p><strong>5. O que &eacute; &quot;persona&quot; em um projeto de UX?</strong></p>
<p>a) Um perfil fict&iacute;cio que representa um grupo de usu&aacute;rios
com caracter&iacute;sticas e comportamentos similares.<br/>
b) Um
tipo de prot&oacute;tipo de baixa fidelidade.<br/>
c) Um m&eacute;todo
para medir a satisfa&ccedil;&atilde;o do usu&aacute;rio atrav&eacute;s
de pesquisas quantitativas.<br/>
d) A interface gr&aacute;fica de um
sistema que define os elementos de intera&ccedil;&atilde;o com o
usu&aacute;rio.</p>
<p><strong>Resposta correta: a)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Persona &eacute; uma
representa&ccedil;&atilde;o fict&iacute;cia de um usu&aacute;rio
t&iacute;pico, baseada em dados reais e comportamentos observados.
Ela ajuda os designers a entenderem melhor as necessidades, desejos e
problemas dos usu&aacute;rios ao criar produtos.</p>
<hr/>

<p><strong>6. No design de UX, o que &eacute; &quot;feedback&quot; e
qual sua import&acirc;ncia?</strong></p>
<p>a) A coleta de informa&ccedil;&otilde;es dos usu&aacute;rios ap&oacute;s
a conclus&atilde;o de um projeto.<br/>
b) A resposta visual ou
auditiva dada ao usu&aacute;rio em resposta a uma a&ccedil;&atilde;o,
como um clique ou preenchimento de formul&aacute;rio.<br/>
c) O
processo de avaliar a efic&aacute;cia do design utilizando m&eacute;tricas
de desempenho.<br/>
d) A an&aacute;lise da concorr&ecirc;ncia para
melhorar o design de um sistema.</p>
<p><strong>Resposta correta: b)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Feedback &eacute; a
resposta que o sistema oferece ao usu&aacute;rio ap&oacute;s ele
realizar uma a&ccedil;&atilde;o. Isso pode ser visual (como uma
mudan&ccedil;a de cor de um bot&atilde;o) ou auditivo (um som). Ele &eacute;
crucial para garantir que o usu&aacute;rio saiba que a a&ccedil;&atilde;o
foi registrada ou conclu&iacute;da com sucesso.</p>
<hr/>

<p><strong>7. Qual &eacute; o principal objetivo da &quot;Arquitetura
da Informa&ccedil;&atilde;o&quot; em um projeto de UX?</strong></p>
<p>a) Organizar e estruturar o conte&uacute;do de um site ou
aplicativo de forma l&oacute;gica e f&aacute;cil de navegar.<br/>
b)
Definir a identidade visual do produto, como cores e logotipos.<br/>
c)
Desenvolver funcionalidades espec&iacute;ficas para melhorar a
experi&ecirc;ncia do usu&aacute;rio.<br/>
d) Criar prot&oacute;tipos
de alta fidelidade para simular o uso do sistema.</p>
<p><strong>Resposta correta: a)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Arquitetura da
Informa&ccedil;&atilde;o trata de organizar o conte&uacute;do de
forma clara e estruturada para facilitar a navega&ccedil;&atilde;o do
usu&aacute;rio, de modo que ele encontre rapidamente o que procura.</p>
<hr/>

<p><strong>8. O que &eacute; &quot;Responsividade&quot; em design de
UX?</strong></p>
<p>a) A capacidade do sistema de se ajustar &agrave; forma como o
usu&aacute;rio interage com ele.<br/>
b) A adapta&ccedil;&atilde;o do
layout e funcionalidades de um site para diferentes dispositivos,
como smartphones e desktops.<br/>
c) A maneira como o sistema
responde aos comandos do usu&aacute;rio, sem erros ou falhas.<br/>
d)
A velocidade com que o sistema executa as tarefas solicitadas pelo
usu&aacute;rio.</p>
<p><strong>Resposta correta: b)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Responsividade se
refere &agrave; capacidade de um site ou aplica&ccedil;&atilde;o de
ajustar seu layout e funcionalidades de acordo com o dispositivo em
que est&aacute; sendo acessado (por exemplo, desktop, tablet ou
smartphone).</p>
<hr/>

<p><strong>9. Em projetos de UX, qual &eacute; a finalidade principal
de realizar um &quot;Prot&oacute;tipo de Baixa Fidelidade&quot;?</strong></p>
<p>a) Validar a usabilidade de um produto com usu&aacute;rios
reais.<br/>
b) Testar a est&eacute;tica do produto com o
p&uacute;blico-alvo.<br/>
c) Representar rapidamente a estrutura e a
intera&ccedil;&atilde;o de um sistema sem se preocupar com detalhes
visuais.<br/>
d) Garantir que a plataforma seja compat&iacute;vel com
diferentes sistemas operacionais.</p>
<p><strong>Resposta correta: c)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Prot&oacute;tipos de
baixa fidelidade s&atilde;o esbo&ccedil;os r&aacute;pidos que se
concentram na estrutura e nas intera&ccedil;&otilde;es de um sistema,
sem se preocupar com aspectos visuais. O objetivo &eacute; testar as
ideias iniciais e obter feedback rapidamente.</p>
<hr/>

<h3 class="western"><strong>Quest&otilde;es sobre Sistemas de Gest&atilde;o
de Conte&uacute;do (CMS)</strong></h3>
<p><strong>10. O que caracteriza um Sistema de Gest&atilde;o de
Conte&uacute;do (CMS)?</strong></p>
<p>a) Um sistema usado para controlar a seguran&ccedil;a e a
privacidade de dados de usu&aacute;rios em uma plataforma.<br/>
b)
Uma ferramenta que permite criar, gerenciar e modificar conte&uacute;do
digital sem a necessidade de conhecimentos t&eacute;cnicos.<br/>
c)
Um sistema de armazenamento de dados utilizado para gerenciar grandes
volumes de informa&ccedil;&otilde;es de clientes.<br/>
d) Um software
para monitorar a performance de sites e aplicativos em tempo real.</p>
<p><strong>Resposta correta: b)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> O CMS permite que os
usu&aacute;rios criem, gerenciem e modifiquem conte&uacute;do digital
sem a necessidade de habilidades t&eacute;cnicas, como codifica&ccedil;&atilde;o.
Ele simplifica o processo de publica&ccedil;&atilde;o de conte&uacute;do.</p>
<hr/>

<p><strong>11. Quais s&atilde;o os principais tipos de CMS utilizados
atualmente?</strong></p>
<p>a) CMS propriet&aacute;rio e CMS de c&oacute;digo aberto.<br/>
b)
CMS para blogs e CMS para e-commerce.<br/>
c) CMS de rede social e
CMS de intranet.<br/>
d) CMS est&aacute;tico e CMS din&acirc;mico.</p>
<p><strong>Resposta correta: a)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Os CMS podem ser
classificados em dois tipos principais: propriet&aacute;rio
(desenvolvido por empresas e com licen&ccedil;as pagas) e de c&oacute;digo
aberto (dispon&iacute;veis gratuitamente e com c&oacute;digo-fonte
acess&iacute;vel).</p>
<hr/>

<p><strong>12. Qual &eacute; a fun&ccedil;&atilde;o da &quot;Arquitetura
de Informa&ccedil;&atilde;o&quot; em um CMS?</strong></p>
<p>a) Organizar e estruturar as funcionalidades t&eacute;cnicas de um
CMS.<br/>
b) Organizar e categorizar o conte&uacute;do para facilitar
sua navega&ccedil;&atilde;o e recupera&ccedil;&atilde;o.<br/>
c)
Criar layouts gr&aacute;ficos para o CMS.<br/>
d) Gerenciar a
performance e escalabilidade do CMS.</p>
<p><strong>Resposta correta: b)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> A arquitetura da
informa&ccedil;&atilde;o em um CMS refere-se &agrave; organiza&ccedil;&atilde;o,
categoriza&ccedil;&atilde;o e estrutura&ccedil;&atilde;o do conte&uacute;do
para garantir que os usu&aacute;rios possam encontrar facilmente o
que procuram.</p>
<hr/>

<p><strong>13. O que s&atilde;o &quot;Portais Corporativos&quot; em
termos de gest&atilde;o de conte&uacute;do?</strong></p>
<p>a) Sites pessoais de funcion&aacute;rios que cont&ecirc;m
informa&ccedil;&otilde;es e atualiza&ccedil;&otilde;es sobre a
empresa.<br/>
b) Ferramentas utilizadas para gerenciar e distribuir
conte&uacute;do corporativo em uma intranet ou extranet.<br/>
c)
Plataformas de redes sociais corporativas para intera&ccedil;&atilde;o
entre funcion&aacute;rios.<br/>
d) Sistemas de e-mail corporativo
usados para comunica&ccedil;&atilde;o interna.</p>
<p><strong>Resposta correta: b)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Portais corporativos
s&atilde;o plataformas utilizadas para gerenciar e distribuir
conte&uacute;do dentro de uma organiza&ccedil;&atilde;o, geralmente
em uma intranet ou extranet, permitindo o acesso controlado a
informa&ccedil;&otilde;es relevantes para os funcion&aacute;rios.</p>
<p style="line-height: 100%; margin-bottom: 0cm"><br/>

</p>
<p style="line-height: 100%; margin-bottom: 0cm"><br/>

</p>
<p style="line-height: 100%; margin-bottom: 0cm"><br/>

</p>
<p>15 quest&otilde;es de m&uacute;ltipla escolha sobre os t&oacute;picos
que voc&ecirc; mencionou, com foco em &quot;Workflow&quot;,
&quot;Conceitos de Acessibilidade e Usabilidade&quot; e &quot;Desenho
e Planejamento de Intera&ccedil;&atilde;o em Aplica&ccedil;&otilde;es
Web&quot;. Cada quest&atilde;o ter&aacute; a resposta correta e uma
explica&ccedil;&atilde;o detalhada. Essas quest&otilde;es s&atilde;o
formuladas no estilo da banca FGV, com explica&ccedil;&otilde;es
claras para cada alternativa.</p>
<hr/>

<h3 class="western"><strong>Quest&otilde;es sobre Workflow e
Planejamento de Intera&ccedil;&atilde;o</strong></h3>
<p><strong>1. O que &eacute; um &quot;Workflow&quot; no contexto de
desenvolvimento de software?</strong></p>
<p>a) Um conjunto de a&ccedil;&otilde;es e etapas que descrevem como
um sistema realiza tarefas espec&iacute;ficas.<br/>
b) A interface de
usu&aacute;rio que permite ao usu&aacute;rio interagir com o sistema
de forma eficiente.<br/>
c) A documenta&ccedil;&atilde;o t&eacute;cnica
que descreve a arquitetura do sistema.<br/>
d) O processo de
codifica&ccedil;&atilde;o do sistema de maneira modular.</p>
<p><strong>Resposta correta: a)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> &quot;Workflow&quot;
refere-se ao conjunto de a&ccedil;&otilde;es e etapas que s&atilde;o
realizadas para concluir uma tarefa espec&iacute;fica dentro de um
processo. No contexto de desenvolvimento de software, ele descreve
como as tarefas e informa&ccedil;&otilde;es fluem atrav&eacute;s do
sistema.</p>
<hr/>

<p><strong>2. Qual &eacute; o papel do workflow no design de uma
aplica&ccedil;&atilde;o web?</strong></p>
<p>a) Definir a arquitetura de informa&ccedil;&otilde;es e o layout
visual da interface.<br/>
b) Organizar as etapas e a&ccedil;&otilde;es
que os usu&aacute;rios devem seguir para alcan&ccedil;ar seus
objetivos dentro da aplica&ccedil;&atilde;o.<br/>
c) Controlar a
performance e a velocidade de carregamento das p&aacute;ginas.<br/>
d)
Determinar as permiss&otilde;es de acesso e seguran&ccedil;a para os
usu&aacute;rios da aplica&ccedil;&atilde;o.</p>
<p><strong>Resposta correta: b)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> O workflow em design de
uma aplica&ccedil;&atilde;o web organiza as etapas e intera&ccedil;&otilde;es
que os usu&aacute;rios devem seguir para alcan&ccedil;ar seus
objetivos dentro do sistema. Ele visa tornar as tarefas intuitivas e
eficientes.</p>
<hr/>

<p><strong>3. Como o conceito de &quot;fluxo de trabalho&quot;
(workflow) pode impactar a experi&ecirc;ncia do usu&aacute;rio em uma
aplica&ccedil;&atilde;o?</strong></p>
<p>a) Melhora a usabilidade, tornando a navega&ccedil;&atilde;o mais
intuitiva e eficiente.<br/>
b) Reduz a necessidade de realizar testes
de usabilidade, pois a estrutura j&aacute; est&aacute; definida.<br/>
c)
Facilita a cria&ccedil;&atilde;o de layouts mais complexos e
detalhados.<br/>
d) Permite que os usu&aacute;rios interajam apenas
com a parte visual do sistema, ignorando sua funcionalidade.</p>
<p><strong>Resposta correta: a)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> O fluxo de trabalho bem
definido melhora a usabilidade ao tornar a navega&ccedil;&atilde;o e
as intera&ccedil;&otilde;es mais intuitivas. Ele permite que os
usu&aacute;rios realizem suas tarefas de maneira mais eficiente, sem
confus&atilde;o ou esfor&ccedil;o excessivo.</p>
<hr/>

<h3 class="western"><strong>Quest&otilde;es sobre Acessibilidade e
Usabilidade</strong></h3>
<p><strong>4. O que &eacute; &quot;acessibilidade&quot; no contexto
de design de interfaces?</strong></p>
<p>a) A capacidade de uma interface ser entendida e utilizada apenas
por usu&aacute;rios com habilidades t&eacute;cnicas avan&ccedil;adas.<br/>
b)
O processo de garantir que a interface possa ser usada por pessoas
com diferentes tipos de defici&ecirc;ncia.<br/>
c) A cria&ccedil;&atilde;o
de um layout visualmente atraente, com uso de cores e fontes
sofisticadas.<br/>
d) A implementa&ccedil;&atilde;o de tecnologias
que tornam a interface mais r&aacute;pida e eficiente.</p>
<p><strong>Resposta correta: b)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Acessibilidade no
design de interfaces envolve criar produtos que possam ser usados por
pessoas com diferentes tipos de defici&ecirc;ncia, como defici&ecirc;ncias
visuais, auditivas ou motoras, garantindo que todos possam acessar e
interagir com o conte&uacute;do.</p>
<hr/>

<p><strong>5. O que caracteriza uma interface &quot;us&aacute;vel&quot;?</strong></p>
<p>a) Uma interface que tem um design visual atraente e detalhado.<br/>
b)
Uma interface que requer que o usu&aacute;rio siga um longo manual de
instru&ccedil;&otilde;es para us&aacute;-la.<br/>
c) Uma interface
que permite ao usu&aacute;rio realizar tarefas de forma eficiente e
satisfat&oacute;ria, sem dificuldade ou frustra&ccedil;&atilde;o.<br/>
d)
Uma interface que oferece muitas op&ccedil;&otilde;es para o usu&aacute;rio
escolher, sem limita&ccedil;&otilde;es.</p>
<p><strong>Resposta correta: c)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Usabilidade refere-se &agrave;
facilidade com que os usu&aacute;rios conseguem realizar tarefas de
forma eficiente, eficaz e com satisfa&ccedil;&atilde;o. Uma interface
us&aacute;vel minimiza a frustra&ccedil;&atilde;o e permite que o
usu&aacute;rio atinja seus objetivos com rapidez e sem dificuldades.</p>
<hr/>

<p><strong>6. Qual &eacute; a import&acirc;ncia de testes de
acessibilidade em uma aplica&ccedil;&atilde;o web?</strong></p>
<p>a) Garantir que a aplica&ccedil;&atilde;o funcione em todos os
navegadores e dispositivos.<br/>
b) Certificar-se de que a aplica&ccedil;&atilde;o
pode ser usada por pessoas com defici&ecirc;ncias, como deficientes
visuais ou auditivos.<br/>
c) Melhorar o desempenho da aplica&ccedil;&atilde;o
em termos de tempo de carregamento e interatividade.<br/>
d) Reduzir
a complexidade do c&oacute;digo e aumentar a seguran&ccedil;a da
aplica&ccedil;&atilde;o.</p>
<p><strong>Resposta correta: b)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Testes de
acessibilidade s&atilde;o cruciais para garantir que as pessoas com
defici&ecirc;ncias possam acessar e usar a aplica&ccedil;&atilde;o
sem dificuldades. Isso envolve adaptar a interface para ser
compat&iacute;vel com tecnologias assistivas, como leitores de tela
ou dispositivos de entrada alternativos.</p>
<hr/>

<p><strong>7. Quais s&atilde;o algumas das principais pr&aacute;ticas
de acessibilidade em uma aplica&ccedil;&atilde;o web?</strong></p>
<p>a) Uso de fontes grandes e cores contrastantes para melhorar a
leitura.<br/>
b) Exibi&ccedil;&atilde;o de anima&ccedil;&otilde;es e
efeitos gr&aacute;ficos complexos para tornar a interface mais
atraente.<br/>
c) Fornecimento de m&uacute;ltiplas op&ccedil;&otilde;es
de navega&ccedil;&atilde;o sem considerar o tipo de defici&ecirc;ncia
do usu&aacute;rio.<br/>
d) Acesso apenas a conte&uacute;dos
est&aacute;ticos, sem suporte para intera&ccedil;&otilde;es
din&acirc;micas.</p>
<p><strong>Resposta correta: a)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Algumas pr&aacute;ticas
importantes de acessibilidade incluem o uso de fontes grandes, cores
com alto contraste e o fornecimento de alternativas textuais para
imagens, garantindo que pessoas com defici&ecirc;ncia visual possam
usar a aplica&ccedil;&atilde;o.</p>
<hr/>

<h3 class="western"><strong>Quest&otilde;es sobre Desenho e
Planejamento de Intera&ccedil;&atilde;o em Aplica&ccedil;&otilde;es
Web</strong></h3>
<p><strong>8. No planejamento de intera&ccedil;&atilde;o de uma
aplica&ccedil;&atilde;o web, o que deve ser considerado para garantir
uma boa experi&ecirc;ncia ao usu&aacute;rio?</strong></p>
<p>a) Apenas a est&eacute;tica da interface, como cores e fontes.<br/>
b)
A navega&ccedil;&atilde;o intuitiva, a efici&ecirc;ncia nas tarefas e
o tempo de resposta das intera&ccedil;&otilde;es.<br/>
c) A
complexidade dos processos internos, para que os usu&aacute;rios
possam aprender mais sobre o sistema.<br/>
d) A escolha de
ferramentas de an&aacute;lise de dados para monitorar o comportamento
do usu&aacute;rio.</p>
<p><strong>Resposta correta: b)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Para garantir uma boa
experi&ecirc;ncia ao usu&aacute;rio, &eacute; fundamental planejar
uma navega&ccedil;&atilde;o intuitiva, otimizar a execu&ccedil;&atilde;o
das tarefas e reduzir o tempo de resposta das intera&ccedil;&otilde;es.
Isso proporciona uma experi&ecirc;ncia eficiente e sem frustra&ccedil;&otilde;es.</p>
<hr/>

<p><strong>9. O que &eacute; um &quot;fluxo de intera&ccedil;&atilde;o&quot;
(interaction flow) em uma aplica&ccedil;&atilde;o web?</strong></p>
<p>a) A sequ&ecirc;ncia de telas que o usu&aacute;rio percorre
durante sua jornada no sistema.<br/>
b) O c&oacute;digo de
programa&ccedil;&atilde;o que define o comportamento dos elementos da
interface.<br/>
c) O processo de valida&ccedil;&atilde;o de dados do
usu&aacute;rio em cada etapa da navega&ccedil;&atilde;o.<br/>
d) A
representa&ccedil;&atilde;o gr&aacute;fica dos dados do usu&aacute;rio
em tempo real.</p>
<p><strong>Resposta correta: a)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> O fluxo de intera&ccedil;&atilde;o
&eacute; a sequ&ecirc;ncia de etapas ou telas pelas quais o usu&aacute;rio
passa ao interagir com uma aplica&ccedil;&atilde;o. Ele descreve como
os usu&aacute;rios navegam e interagem com o sistema para completar
tarefas espec&iacute;ficas.</p>
<hr/>

<p><strong>10. Como a &quot;hierarquia visual&quot; afeta o design de
intera&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o web?</strong></p>
<p>a) Ela determina a ordem em que as informa&ccedil;&otilde;es s&atilde;o
apresentadas ao usu&aacute;rio, facilitando a compreens&atilde;o e a
navega&ccedil;&atilde;o.<br/>
b) Ela define os tipos de anima&ccedil;&otilde;es
e transi&ccedil;&otilde;es que ser&atilde;o usadas entre as telas.<br/>
c)
Ela foca em criar uma interface visualmente esteticamente complexa,
sem preocupa&ccedil;&atilde;o com a clareza.<br/>
d) Ela organiza os
dados t&eacute;cnicos do sistema de maneira compreens&iacute;vel para
os desenvolvedores.</p>
<p><strong>Resposta correta: a)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> A hierarquia visual &eacute;
uma t&eacute;cnica de design que organiza os elementos de forma que o
usu&aacute;rio entenda rapidamente quais informa&ccedil;&otilde;es
s&atilde;o mais importantes. Isso melhora a navega&ccedil;&atilde;o e
torna a experi&ecirc;ncia mais fluida e intuitiva.</p>
<hr/>

<p><strong>11. Qual &eacute; o principal objetivo de uma &quot;persona&quot;
no planejamento de intera&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o
web?</strong></p>
<p>a) Criar um modelo detalhado de todos os elementos visuais da
interface.<br/>
b) Representar um tipo de usu&aacute;rio com
necessidades e comportamentos espec&iacute;ficos, para guiar o design
da interface.<br/>
c) Determinar a arquitetura t&eacute;cnica e a
infraestrutura do sistema.<br/>
d) Medir a performance da aplica&ccedil;&atilde;o
com base nas a&ccedil;&otilde;es do usu&aacute;rio.</p>
<p><strong>Resposta correta: b)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Uma persona &eacute; um
perfil fict&iacute;cio que representa um grupo de usu&aacute;rios com
caracter&iacute;sticas e comportamentos semelhantes. Ela ajuda os
designers a criar interfaces mais centradas nas necessidades e
comportamentos reais dos usu&aacute;rios.</p>
<hr/>

<p><strong>12. O que significa o termo &quot;feedback&quot; no
contexto de intera&ccedil;&atilde;o de uma aplica&ccedil;&atilde;o
web?</strong></p>
<p>a) A resposta visual ou auditiva que o sistema fornece ao usu&aacute;rio
ap&oacute;s ele realizar uma a&ccedil;&atilde;o.<br/>
b) A coleta de
opini&otilde;es dos usu&aacute;rios ap&oacute;s o uso do sistema.<br/>
c)
O processo de gerar relat&oacute;rios autom&aacute;ticos sobre o
desempenho do sistema.<br/>
d) A capacidade do sistema de prever as
pr&oacute;ximas a&ccedil;&otilde;es do usu&aacute;rio com base no seu
comportamento anterior.</p>
<p><strong>Resposta correta: a)</strong></p>
<p><strong>Explica&ccedil;&atilde;o:</strong> Feedback &eacute; a
resposta fornecida pelo sistema ap&oacute;s uma intera&ccedil;&atilde;o
do usu&aacute;rio, como um som ou uma mudan&ccedil;a visual. Isso
ajuda o usu&aacute;rio a entender que a a&ccedil;&atilde;o foi
registrada e o que acontece em seguida.</p>
<p style="line-height: 100%; margin-bottom: 0cm"><br/>

</p>
</body>
</html>